Revit 2027 API
StructuralSectionConcreteRectangleCut.TopCutHeight Property
 Section height right Cut.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TopCutHeight { get; set; }
Public Property TopCutHeight As Double
	Get
	Set
public:
property double TopCutHeight {
	double get ();
	void set (double value);
}
member TopCutHeight : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionConcreteRectangleCut Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace